"""Функции для тестирования решений"""


def rosenbrock(x, a=1, b=100):
	"""
	Для a=1, b=100:
		Точка минимума: (1, 1)
		Минимальное значение: 0
	"""
	
	return (a - x[0]**2) + b*(x[1] - x[0]**2)**2


def beale(x, a=1.5, b=2.25, c=2.625):
	"""
	Для a=1.5, b=2.25, c=2.625:
		Точка минимума: (3, 0.5)
		Минимальное значение: 0
	"""

	return (a - x[0] + x[0]*x[1])**2 + (b - x[0] + x[0]*(x[1]**2))**2 + (c - x[0] + x[0]*(x[1]**3))**2


def matyas(x, a=0.26, b=0.48):
	"""
	Для a=0.26, b=0.48:
		Точка минимума: (0, 0)
		Минимальное значение: 0
	"""

	return a*(x[0]**2 + x[1]**2) - b*x[0]*x[1]
